package Model;

public class PokemonBookAns {
	
	public static String[] ans() //23~44 : 중
	{
		return new String[] {"거북왕","골덕","괴력몬","깨비참","날쌩마","내루미","냄새꼬","닥트리오","단대기","덩쿠리",
				 "리자드","모래두지","뮤","부스터","뿔충이","스라크","아쿠스타","우츠동","이상해씨","잠만보","크랩",
				 "파오리","피카츄","가보리","가이오가","가재군","갈모매","그란돈","나무킹","눈꼬마","도토링","독케일","둔타","레쿠쟈","로젤리아","먹고자",
				 "물짱이","버섯꼬","비구슬","선인왕","아차모","에나비","연꽃몬","지라치","톱치",
				 "가라티나","거대코뿌리","거북손손","고디탱","골비람","노보청","돌살이",
				 "동미러","뚜꾸리","무우마직","불켜미","뽀록나","수댕이","쌔비냥","악비아르","암트르",
				 "에몽가","엘풍","오케이징","요테리","으랏차","콩둘기","파쪼옥","휠구"

		};
	}

}
