package Model;

public class PokemonBookHint {

	
	public static String[] hint() //23~44 : 중
	{
		return new String[] {
				"ㄱㅂㅇ","ㄱㄷ","ㄱㄹㅁ","ㄲㅂㅊ","ㄴㅆㅁ","ㄴㄹㅁ","ㄴㅅㄲ","ㄷㅌㄹㅇ","ㄷㄷㄱ","ㄷㅋㄹ","ㄹㅈㄷ","ㅁㄹㄷㅈ","ㅁ","ㅂㅅㅌ","ㅃㅊㅇ","ㅅㄹㅋ","ㅇㅋㅅㅌ","ㅇㅊㄷ","ㅇㅅㅎㅆ",
				"ㅈㅁㅂ","ㅋㄹ","ㅍㅇㄹ","ㅍㅋㅊ","ㄱㅂㄹ","ㄱㅇㅇㄱ","ㄱㅈㄱ","ㄱㅁㅁ","ㄱㄹㄷ","ㄴㅁㅋ","ㄴㄲㅁ","ㄷㅌㄹ","ㄷㅋㅇ","ㄷㅌ","ㄹㅋㅈ","ㄹㅈㄹㅇ","ㅁㄱㅈ","ㅁㅉㅇ","ㅂㅅㄲ","ㅂㄱㅅ",
				"ㅅㅇㅇ","ㅇㅊㅁ","ㅇㄴㅂ","ㅇㄲㅁ","ㅈㄹㅊ","ㅌㅊ","ㄱㄾㄴ","ㄱㄷㅋㅃㄹ","ㄱㅂㅅㅅ","ㄱㄷㅌ","ㄱㅂㄹ","ㄴㅂㅊ","ㄷㅅㅇ","ㄷㅁㄹ","ㄸㄲㄹ","ㅁㅇㅁㅈ",
				"ㅂㅋㅁ","ㅃㄹㄴ","ㅅㄷㅇ","ㅆㅂㄴ","ㅇㅂㅇㄹ","ㅇㅌㄹ","ㅇㅁㄱ","ㅇㅍ","ㅇㅋㅇㅈ","ㅇㅌㄹ","ㅇㄹㅊ","ㅋㄷㄱ","ㅍㅉㅇ","ㅎㄱ"
		};
	}
	
}
